'''
    算术运算符： + - * /(保留小数)  //(保留整数部分)  %（取模运算）

'''
# 剥离100~999之间一个数,并判断这些数是否是水仙数
# 123 = 1 * 1 * 1 + 2 * 2 * 2 + 3 * 3 * 3
# 157 是不是水仙花数！
'''
for a in range(100,1000):
    b = a // 100
    s = a // 10 % 10
    g = a % 10
    if pow(g,3) + pow(b,3) + pow(s,3) ==  a:
        print(a,"是水仙花数！")



    g*g*g
    pow(g,3)
    g**3

print(2**4)

'''






# 进制
'''
    二进制：0 1
        表现：0b
        例子：0b1011001
    八进制：0 1 2 3 4 5 6 7
        表现形式：0o
        例子：0o7502
    十六进制：0 1 2 3 4 5 6 7 8 9 a(10) b(11) c(12) d(13) e(14) f(15)
        表现：0x
        例子：0xf52d
    运算符：
        
'''
print(7 | 5)
'''
|：见1为1，其他为0
    111
    101
|
------------
    111    = 7
'''
print(6 | 3)
'''
    110
    011
|
---------
    111   = 7

'''

# &：两位都为1结果1，其他为0
print(6&3)
'''
    110
    011
&
------------
    010   = 2
'''


# 异或： ^ :  不同为1，其他为0
print(6 ^ 3)
'''
    110
    011
^
-----------
    101  = 5
'''






















